Tasks/ЗадачиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Task>
		<Properties>
			<Name>ЗадачиПользователя</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НужноСделать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/ЗадачиПользователя/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус)
	Для каждого ТекЗадача Из МассивЗадач Цикл  
		ЗадачаОбъект = ТекЗадача.ПолучитьОбъект(); 
		Если ЗадачаОбъект.Статус = НовыйСтатус Тогда
			 Продолжить;
		КонецЕсли;
		
		ЗадачаОбъект.Статус = НовыйСтатус; 
		
		Если НовыйСтатус = Перечисления.СтатусыЗадач.Готово Тогда
			 ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;

		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить статус задачи " + ТекЗадача + " по причине:" + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	  
    КонецЦикла;
КонецПроцедуры  

&НаКлиенте
Процедура СписокНужноВыполнитьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	Если ТипЗНЧ(МассивЗадач) = Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НужноСделать"));
	КонецЕсли; 
	
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя"));
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	Если ТипЗНЧ(МассивЗадач) = Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.ВРаботе"));
	КонецЕсли;   
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя"));

КонецПроцедуры

&НаКлиенте
Процедура СписокГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	Если ТипЗНЧ(МассивЗадач) = Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
	КонецЕсли;      
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя"));

КонецПроцедуры
